{"id":545,"date":"2018-10-29T11:55:18","date_gmt":"2018-10-29T11:55:18","guid":{"rendered":"https:\/\/writingcreek.com\/?page_id=545"},"modified":"2018-11-29T14:34:37","modified_gmt":"2018-11-29T14:34:37","slug":"faq","status":"publish","type":"page","link":"https:\/\/writingcreek.com\/faq\/","title":{"rendered":"FAQ"},"content":{"rendered":"<p><strong>Do you hire writers?<\/strong><br \/>\nAs a fast-growing company, we are constantly hiring freelance writers from all over the world. It does not matter for us what your native language is. The main requirement is your English writing skills.<br \/>\n<strong>What is the pricing?<\/strong><br \/>\nThe price for the order depends on the number of pages, complexity, and urgency. For the easiest orders the price starts from $4 per page, while for the most complicated orders it may come up to $10 per page.<\/p>\n<p><strong>How can I get work?<\/strong><br \/>\nIn order to join our team, you need to pass the following steps of application process:<\/p>\n<ul>\n<li>Register by providing us with your personal information and your professional skills.<\/li>\n<li>Pass the test that will help us identify your English level.<\/li>\n<li>Complete a sample essay on the provided topic (275-300 words).<\/li>\n<\/ul>\n<p>That`s it. Once all the steps are completed, our HR Manager will review your application and provide you with a feedback within 10 business days. After successful approval, you will have access to the available orders in the system.<br \/>\n<strong>I have not passed the test but can I work?<\/strong><br \/>\nUnfortunately, we cannot accept the writer without passing the test. All our applicants should prove their skills in order to join our team.<br \/>\n<strong>Can I pass the test again if I failed it for the first time?<\/strong><br \/>\nIf the test was failed, we recommend that you apply again no earlier than 3 months after the previous application date once the English level is improved.<br \/>\n<strong>How do you pay? <\/strong><br \/>\nThe payment is released twice per month (each second Friday of the month) upon your request. You are welcome to choose the most appropriate payment method for you among the following:<\/p>\n<ul>\n<li>PayPal;<\/li>\n<li>Payoneer;<\/li>\n<li>Skrill.<\/li>\n<\/ul>\n<p>The fees depend on each payment method individually.<br \/>\n<strong>What is the purpose of the job on your website?<\/strong><br \/>\nWe serve as a mediator between the people who need some assistance with their academic researches and professional academic freelancers who are ready to offer their writing services in exchange for a decent payment. We do not engage into any cheating or fraudulent activities, but provide our clients with samples and examples of research written by our hired writers. Also, we help the customers with their written works and proofread their papers.<br \/>\n<strong>Is it ethical to work as a writer? <\/strong><br \/>\nWe provide our clients with the papers that can be used as samples, sources of information, or examples of the research. Apart from such assignments, we also have orders which require simple editing\/proofreading, or which are only a part of the research. Moreover, you are the only one who can choose which order to complete.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you hire writers? As a fast-growing company, we are constantly hiring freelance writers from all over the world. It does not matter for us what your native language is. The main requirement is your English writing skills. What is the pricing? The price for the order depends on the number of pages, complexity, and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"tpl-faq.php","meta":[],"_links":{"self":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/545"}],"collection":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/comments?post=545"}],"version-history":[{"count":9,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/545\/revisions"}],"predecessor-version":[{"id":743,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/545\/revisions\/743"}],"wp:attachment":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/media?parent=545"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}