{"id":594,"date":"2018-10-30T15:05:05","date_gmt":"2018-10-30T15:05:05","guid":{"rendered":"https:\/\/writingcreek.com\/?page_id=594"},"modified":"2022-12-22T09:52:31","modified_gmt":"2022-12-22T09:52:31","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/writingcreek.com\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"<p><strong>Please Read These Terms Carefully Before Using This Website<\/strong><\/p>\n<p>The contents on this website <a href=\"https:\/\/writingcreek.com\">https:\/\/writingcreek.com<\/a> (the “Site”) are provided by <strong>I3 Technology LTD<\/strong> (hereinafter referred to as “I3”). The Site is an online platform that provides onboarding for Writers to prepare them to taking orders and working with Customers afterward. <strong>By using this Site, you agree to these Terms of Use and any operating rules, policies, and procedures that are published on this Site by I3 (collectively the “Terms”). If you do not agree to them, do not use the Site, take an order, or deal therewith otherwise.<\/strong><\/p>\n<p><strong>1. Definitions<\/strong><\/p>\n<p>1.1. “Writer” (referred to as “You”) is the person who has agreed to provide editing, proofreading, rewriting, or other services on a freelance basis as may be requested by the Customer (“User”)  under these Terms.<\/p>\n<p>1.2. “Customer” (“User”) is the person who places an order through I3 to obtain the services or a product according to the requirements that may be specified in such order, and is governed by these Terms.<\/p>\n<p>1.3. “Order” is an electronic request from the Customer for a paid service or a particular product. Order specifies the requirements of the Customer regarding the product or service.<\/p>\n<p>1.4. “Product” is an outcome of Writer’s efforts that is developed and delivered to the Customer in accordance with the order requirements, in electronic format.<\/p>\n<p>1.5. “Revision” is an edited version of the original product initiated by the Customer.<\/p>\n<p>1.6. “Support Team”, or “Support”, is the part of I3’s organizational structure with the mission to assist and coordinate the order process, product, and\/or service.<\/p>\n<p>1.7. “Order Status” is the stage at which the order is being processed at the present time.<\/p>\n<p>1.8. “Quality Assurance Department” is a part of I3’s organizational structure with the mission to evaluate the quality of the provided products or services.<\/p>\n<p>1.9. “Messaging System” is an interactive tool that ensures effective communication between the Customer and the Support\/Writer.<\/p>\n<p>1.10. “Fine” is an amount of money that has to be paid by the Writer as a penalty for violation of the I3’s standards and order requirements.<\/p>\n<p><strong>2. Acceptance of Terms<\/strong><\/p>\n<p>I3 offers this platform to enable You to provide your services to Customers on condition that You accept these Terms and any operating rules, policies, and procedures that are published on this Site by I3 (collectively the “Terms”). The following Terms govern your access to and use of the Site. Your registration and use of the Site constitute your agreement to all such Terms.<\/p>\n<p>The words “use” or “using” in these Terms mean any time utilizing, benefiting from, taking advantage of, or interacting with any opportunities, features, and functions enabled by the Site, accessing the content thereof or dealing therewith otherwise, directly or indirectly, with or without the aid of a device, including but not limited to, attempting to access, interact with, use, display, view, print or copy from I3’s platform (see clause 3 below), transmit, receive or exchange data or communicate with the I3’s platform, for any purpose whatsoever.<\/p>\n<p>Unless explicitly stated otherwise, these Terms will govern the use of any new features that augment or enhance the current Site and platform, including the release of new I3’s resources and services.<\/p>\n<p>Please note that <strong>I3 Technology<\/strong> utilizes Hyperwallet payment services to deliver payments to you. Such payment services are subject to the <a href=\"https:\/\/pay.hyperwallet.com\/hw2web\/consumer\/page\/legalAgreement.xhtml\"><span style=\"font-weight: 400;\">Hyperwallet Terms of Service<\/span><\/a><span style=\"font-weight: 400;\"> and the <\/span><a href=\"https:\/\/pay.hyperwallet.com\/hw2web\/consumer\/page\/legalAgreement.xhtml\"><span style=\"font-weight: 400;\">Hyperwallet Privacy Policy.<\/span><\/a><\/p>\n<p><strong>3. The Platform<\/strong><\/p>\n<p>As a platform, I3 ensures delivery of the services by Writers and payment to Writers by Customers. Via this Site, Writers may get access to Customers aiming to contract freelancers with definite skills, payment expectations, Turn Around Time, etc., place bids, and take orders. The above opportunities are enabled following the activation of the Writer’s Account applied to via this Site.<\/p>\n<p>Once Writers accept these Terms to perform the order; it will be their responsibility to complete the order within the agreed time ensuring the quality.<\/p>\n<p>Writers also understand and agree that Your use of I3’s Site and platform may include advertisements and certain messages from I3, such as service announcements, administrative messages, and updates.<\/p>\n<p><strong>4. Standards and Requirements to the Product<\/strong><\/p>\n<p>Product has to be:<\/p>\n<ul>\n<li>original and based on proper argumentation;<\/li>\n<li>structured logically and coherent;<\/li>\n<li>written in accordance with the English grammar, stylistic, and punctuation rules;<\/li>\n<li>composed in the way to meet all the Customer’s instructions and templates;<\/li>\n<li>provided on time.<\/li>\n<\/ul>\n<p>Writers have to follow these formatting requirements (unless asked for something different by the Customer):<\/p>\n<p>1) Application of 1&#8243; margins on all sides.<\/p>\n<p>2) All parts, including the header, must be in Times New Roman with font size 12.<\/p>\n<p>3) The body should be left-aligned.<\/p>\n<p>4) Line spacing must be double, and paragraph spacing must be 0.00.<\/p>\n<p>5) The formatting shall be made according to the format required by the Customer or any of the Writer’s preferences if there are no specific instructions (MLA and APA are preferred).<\/p>\n<p>Plagiarism:<\/p>\n<p>The plagiarism level must be less than 10%, which is checked with the help of our in-built plagiarism checker. When defining the plagiarism level, bibliographical references and cliched phrases are not taken into account. Orders that contain more than 10% of plagiarized information are hidden from Customers and checked by Support Agents individually. For solving the issue faster, Writers have to contact the Support Team, indicate Order ID, and explain the plagiarism rate.<\/p>\n<p>Violation of the standards and requirements stated above will result in fines and the limitation of access to new orders, or may even lead to termination of cooperation.<\/p>\n<p><strong>5. Activation of Account<\/strong><\/p>\n<p>Writers are freelancers and are free to apply for an account if they have reached the age of 18. For an Account to be considered for activation, the Writer has to fill in the registration form at the Website, pass the English grammar test, write a sample piece of content on a given topic, and provide ID and Diploma\/Certificate. Any information provided by applicants will be treated as “personal data” and shall be collected, stored, and processed strictly in accordance with our Privacy Policy, and will not be shared with any other third party, except for our contractors involved for business facilitation purposes.<\/p>\n<p>Within 5-10 business days, the Writers are notified on whether their application is approved or declined. However, the activation period can be extended due to the high number of applicants. Our Account Manager can also ask the Writer to specify some additional information or correct the existing one. In case of application denial, I3 reserves the right not to disclose the reason for it.<\/p>\n<p>Only upon Activation of Account and authorization of contact information, including phone verification, the Writer receives the possibility to place bids for orders and start earning money. While registering on the Site, the Writers have to use a valid email address and a phone number where they can be reached. Support Agents may need to contact them. Providing incorrect information is a violation of these Terms. After Activation of Account, in case the Writer wants to make significant changes in the account details, the Writer may be required to verify the identity.<\/p>\n<p><strong>6. Order Process<\/strong><\/p>\n<p>Writers get access to the list of orders and place their bids for the orders. In case the Writers have questions concerning the order, they have to clarify everything right away as they are responsible for obtaining the details.<\/p>\n<p><strong>Writer Assignment.<\/strong> Once the Customer accepts the Writer’s bid, the Writer starts performing the order. The Customer and the Writer may communicate and discuss all the details via a messaging system.<\/p>\n<p><strong>Messaging System.<\/strong> The platform uses the messaging system for communication, which may be used by the Support Team and Writers as well. Writers can contact the Customers and the Support Team using it, and they undertake to check the messages regularly and promptly address any questions, concerns, or additional instructions using this interactive tool. Writers are not allowed to disclose personal information to Customers and ask them to deal directly without using Writingcreek.com. Once such actions are detected, I3 reserves the right to terminate our cooperation without any further explanation.<\/p>\n<p><strong>Tracking the Order Status<\/strong>. When an order is created by a Customer, both the Customer and the Writer can use the tracking system to see the status of the order. The system reflects the status and percentage of the order completed. The possible statuses of the order are:<\/p>\n<p>&#8211; Bidding – An order is created by a Customer. Customer waits for Writers’ bids.<\/p>\n<p>&#8211; In Progress – Customer selected a suitable Writer and approved the bid. Once the Customer accepted the bid, the funds were reserved for the order. Writer confirmed that all the instructions were clear and started the order performance. Writer delivers the product. Customer reviews it and asks for revision (if any).<\/p>\n<p>&#8211; Under Investigation – Customer requested cancellation of the order; the order is being checked by the Quality Assurance Department or the Billing Department (in case there are issues with the payment). Usually, it takes up to 7 days to investigate the case and resolve the cancel request, but the period can be extended due to the high workload or peculiarities of certain orders. Money released to the Writer is put on hold. It does not return to the Customer’s balance before the issue is resolved. If the Customer’s claims were groundless, order changes to “Finished” status. If the Customer’s claims were valid, order changes to “Cancelled” status.<\/p>\n<p>The status may also be “Under Investigation” if there was a payment issue from the Customer’s side. Regardless of the reason for the investigation, the Writer has to stop performing the order and wait until the order changes the status.<\/p>\n<p>&#8211; Finished – Customer reviewed the final product after the last revision (if any) was provided by the Writer. Customer clicked the “release 100% money” button. The Writer’s fee stays on hold for 7 days in case the Customer requests a refund.<\/p>\n<p>&#8211; Cancelled &#8211; The order can be cancelled due to different reasons such as bad quality, Writer’s failure to provide the product within the agreed deadlines, plagiarism, communication issues, or other technical nuances. Depending on the specific case, there may be financial implications towards Customers and Writers.<\/p>\n<p><strong>7. Delivery<\/strong><\/p>\n<p>I3 shall not be responsible or liable for any type of delivery issues including those resulting from any of the Writer’s service providers such as the Internet, email, etc., which are beyond our control. Our Support Team is available to assist Writers with any delivery problems.<\/p>\n<p><strong>8. Revisions, Reassignments, and Cancellations<\/strong><\/p>\n<p>If the Product does not match the Customer’s specifications and quality standards, the Writers have to revise it to ensure Сustomer’s satisfaction and release of payment. However, Сustomers are not obliged to ask for revisions and can reassign the Writer in case of quality issues, failure to comply with the instructions, difficulties in understanding between Customer and Writer, and lateness of the Product delivery. In the event of reassignment,  the Customer can not download and use the Writer’s Product, and the Writer who has been reassigned does not receive any payment.<\/p>\n<p>After the money is released by the Customer, they can also request a limitless number of revisions within the following time frames:<\/p>\n<ul>\n<li>orders up to 10 pages &#8211; within 14 days after the money release;<\/li>\n<li>orders more than 10 pages &#8211; within 30 days after the money release.<\/li>\n<\/ul>\n<p>If the Customer changes the initial instructions, the Writers have to inform the Customer that it is against policies. If the Customer insists on making a revision according to new instructions,  the Writers should contact the Support Team and report the issue. If a revision request violates the original instructions, the Quality Assurance Department has the right to decline it.<\/p>\n<p>Customers also have a right to request the cancellation of the order. While checking the order by the Quality Assurance Department, the status on the order changes from “In Progress” to “Under Investigation”. It means that the Writer has to stop performing the order and wait for the resolvement.<\/p>\n<p>If the order is “Finished”, it can also be cancelled in case of high plagiarism rate after the Quality Assurance Department checks the plagiarism reports provided by the Customer from the valid checking software, namely SafeAssign, WriteCheck, or Turnitin.<\/p>\n<p>Cancellation request might be declined by the Quality Assurance Department if the Customer’s actions do not have compelling reasons or they were not provided to us. If it is approved, the status of the order will be changed to “Cancelled”. If it is declined, the status of the order will be changed to “Finished”, and the money reserved for the order will be released to the Writer. Based on the decision of the Quality Assurance Department, the Writer might receive full\/partial payment for the order or fine.<\/p>\n<p><strong>9. Modifications<\/strong><\/p>\n<p>I3 reserves the right to modify or discontinue any of the provisions of these Terms, all or part of the Site and\/or platform functionality, temporarily or permanently, with or without any notifications, and is not obligated to support or update accordingly. The amended Terms shall be effective immediately after they are initially posted on the Site. Writer’s continued use of the Site after the posting of the amended Terms on the Site constitutes Writer’s affirmative: (a) acknowledgment of the Terms and modifications thereof, and (b) agreement to abide and be bound by the Terms, as amended. Writer acknowledges and agrees that I3 shall not be liable to Writer or any third party in the event that I3 exercises its right to modify or discontinue all or part of the Site and\/or platform functionality. You are responsible for being familiar with any changes or modifications to these Terms. You can review the most current version of the Terms at any time at <a href=\"https:\/\/writingcreek.com\/terms-of-use\">https:\/\/writingcreek.com\/terms-of-use<\/a>.<\/p>\n<p><strong>10. Use<\/strong><\/p>\n<p>By choosing to use the Site and\/or the platform (a) you warrant that all information you submit is current, true, and accurate; (b) you agree to update this information; (c) you agree not to use the Site and\/or platform for any unlawful purpose.<\/p>\n<p>You confirm that you are of legal age (as defined by the laws of your country) to enter the relevant business relations with I3 and\/or the Customers. You also confirm that you are not a person barred from providing the Services required by the Customers and facilitated via I3’s Site and\/or platform under the laws of your country or other applicable jurisdiction. If you provide any information that is untrue, inaccurate, not current, or incomplete, or if I3 has reasonable grounds to suspect that such information is untrue, inaccurate, not current, or incomplete, I3 has the right to suspend or terminate your Account and refuse any and all current or future use of the Site and\/or platform (or any portion thereof).<\/p>\n<p><strong>11. Payment<\/strong><\/p>\n<p>Once the Customer accepts the Writer’s bid, the funds are reserved for the order. The Writer’s fee is released either by the Customers if they are satisfied with the Product, or by the system 4 business days after the deadline set by the Customer if no issues have been raised. Upon the release, the funds stay on hold for <b>14<\/b> days in case the Customer requests a refund. There is no chance to request the payout of these funds sooner.<\/p>\n<p>Payout takes place once a fortnight on <b>Wednesdays<\/b>. Writers are able to see the payout date on My Balance page and the payment email chosen for payout, and it is their responsibility to check the correctness of the provided details.<\/p>\n<p>The Writer has a right to choose the Payment Method that I3 will use for the processing of any payments. The following Payment Methods are available: <b>Payoneer and Hyperwallet<\/b>. In case the Writer has indicated a wrong payment method, he\/she has to contact the Support Team and ask to cancel the previous payout request and create a new one.<\/p>\n<p>In case of the termination of account, the funds are sent via the last valid payment method chosen by the Writer. After closing the account, Writers are not allowed to change the payment details, and I3 is not responsible for inaccurate or invalid payment details they submitted.<\/p>\n<p>Only an account holder assumes responsibility for anything an authorized user does on an account and thus must not give access to his\/her account to third parties for the sake of security. If the account has been hacked, I3 is not responsible for the payment requests that were made.<\/p>\n<p>NOTICE. All prices are exclusive of (a) any and all fees\/ commissions imposed on you by payment processors and\/or your bank and\/or card issuer (including for currency exchange), (b) taxes and\/or levies as well as other duties established by taxing or other state authorities, and you shall be responsible for payment of all such feed\/ commissions and\/or taxes, and\/or levies, and\/or duties.<\/p>\n<p><strong>12. Privacy<\/strong><\/p>\n<p>We respect Your privacy and use and protect Your Personal Information. I3 collects your name, email address, home address, etc. when you apply for an Account. Such information collected by us about You will be treated as confidential and will not be sold to any third party, but stored securely. We reserve the right to share Your Personal Information with our contractors for business facilitation purposes, subject to the same standards I3 treats Your Personal Information. Please see our Privacy Policy using this link: <a href=\"https:\/\/writingcreek.com\/privacy-policy\">https:\/\/writingcreek.com\/privacy-policy<\/a>.<\/p>\n<p>By writing a testimonial, you agree that I3 is allowed to use your testimonials linked to your Account or not for marketing purposes. I3 is also allowed to place your testimonials on the Site.<\/p>\n<p>You can always contact the Support Team and ask to block\/remove your testimonials if you feel that they may harm your profile.<\/p>\n<p><strong>13. Conduct\/Lawful Use<\/strong><\/p>\n<p>The Writer agrees to abide by the applicable law specified hereby and is solely responsible for the content of its communications through the Site and\/or platform. You agree:<\/p>\n<ol>\n<li>not to use the Site and\/or platform for illegal purposes;<\/li>\n<li>not to interfere or disrupt networks connected to the Site and\/or platform;<\/li>\n<li>to comply with all regulations, policies, and procedures of networks related to the Site and\/or platform;<\/li>\n<li>not to resell or transfer your access to the Account to any third party;<\/li>\n<li>not to restrict any other visitor from using the Site and\/or platform;<\/li>\n<li>to act responsibly, treat Site Customers and other Writers with respect, and not violate their rights;<\/li>\n<li>not to modify, adapt, sublicense, translate, sell, decompile, or disassemble any portion of the Site and\/or platform;<\/li>\n<li>not to harvest or collect information about Customers and other Writers without their express consent;<\/li>\n<li>not to solicit personal information from anyone they may communicate with due to the Site and\/or platform.<\/li>\n<\/ol>\n<p>In case of any violation of these Terms, I3 reserves the right to seek the relevant remedies enabled by the applicable law.<\/p>\n<p><strong>14. Limitation of Liability<\/strong><\/p>\n<p>As a condition to using the Site and\/or platform, the Writer agrees that neither I3, nor any officer, affiliate, director, shareholder, agent, contractor, or employee of I3 will be liable to Writer or any third party for any direct, indirect, incidental, special, punitive, or consequential loss of profits, loss of earnings, loss of business opportunities, damages, expenses, or costs resulting directly or indirectly from any  communications and\/or transactions entered into through the Site and\/or platform or resulting from unauthorized access to, deletion or alteration of Writer’s Products or data or failure of the Site and\/or platform to store Writer’s Products or data, or otherwise arising in connection with the Site and\/or platform even if I3 has been advised of the possibility of such damages.<\/p>\n<p>You specifically acknowledge that I3 shall not be liable for Writer’s Products or the defamatory, offensive, or illegal conduct of any third party, and that the risk of harm or damage from the foregoing is borne entirely by you.<\/p>\n<p>I3 makes no representations that the I3’s Site and\/or platform are appropriate or available for use in any location. Those who access or use the I3’s Site and\/or platform do so at their own intention and are responsible for compliance with local law.<\/p>\n<p><strong>15. Disclaimer\/No Warranty<\/strong><\/p>\n<p>I3’S SITE AND\/OR PLATFORM ARE PROVIDED ON AN “AS IS” BASIS WITHOUT ANY EXPRESS OR IMPLIED WARRANTY OF ANY KIND INCLUDING WARRANTIES OF MERCHANTABILITY, OR NON-INFRINGEMENT OF INTELLECTUAL PROPERTY. IN NO EVENT SHALL I3 BE LIABLE FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, BUSINESS INTERRUPTION, LOSS OF INFORMATION) ARISING OUT OF THE USE OF OR INABILITY TO USE THE SITE AND\/OR PLATFORM; ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND\/OR; ANY AND ALL PERSONAL INFORMATION AND\/OR FINANCIAL INFORMATION STORED THEREIN; ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH OUR SITE AND\/OR PLATFORM BY ANY WRITER, CUSTOMER OR OTHER THIRD PARTY, AND\/OR; ANY ERRORS OR OMISSIONS IN ANY CONTENT, OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, EMAILED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE I3’S SITE. I3 MAY PROVIDE LINKS TO THIRD-PARTY WEBSITES AS WELL AS ADVERTISEMENTS. I3 DOES NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE I3’S SITE OR ANY HYPERLINKED SITE OR FEATURED IN ANY BANNER OR OTHER ADVERTISING. THESE THIRD-PARTY SITES HAVE THEIR OWN PRIVACY POLICIES. WE ENCOURAGE YOU TO REVIEW THE PRIVACY POLICIES OF WEBSITES YOU CHOOSE TO LINK TO FROM WRITINGCREEK.COM SO THAT YOU COULD UNDERSTAND HOW THOSE WEBSITES COLLECT, USE, AND SHARE YOUR INFORMATION. I3 IS NOT RESPONSIBLE FOR THE PRIVACY POLICIES OR OTHER CONTENT ON WEBSITES OUTSIDE OF WRITINGCREEK.COM. AS A HOLDER OF THE SITE AND\/OR PLATFORM, I3 IS NOT LIABLE FOR ANY STATEMENTS, REPRESENTATIONS, OR CONTENT PROVIDED BY WRITERS AND\/OR USERS IN ANY PUBLIC FORUM, BLOG, OR OTHER INTERACTIVE AREA, EVEN IF I3 HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. BECAUSE SOME JURISDICTIONS PROHIBIT THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU.<\/p>\n<p>I3 further does not warrant that the use of the Site and\/or platform will be secure or uninterrupted; the information, text, graphics, links, or other items contained within these materials will be accurate and complete. I3 may make changes to these materials at any time without notice. I3 makes no commitment to update the materials. No oral advice or written information given by I3, its employees, licensors, or the like will create a warranty; nor may you rely on any such information or advice.<\/p>\n<p>I3 is not responsible for any problems or technical malfunction of any communication network or lines, online computer systems, servers or providers, computer equipment, software, failure of any email due to technical problems or traffic congestion on the Internet or on any of the Site and\/or platform or combination thereof, including any injury or damage to Writer or to any person’s computer related to or resulting from participation or downloading materials (for the purpose of viewing only), in connection with the Site and\/or platform.<\/p>\n<p><strong>16. Indemnification<\/strong><\/p>\n<p>Writer will defend, indemnify, and hold harmless I3 and its affiliates, directors, officers, employees, proprietors, independent contractors, consultants, partners, shareholders, representatives, Customers, agents, predecessors, successors, and permitted assigns from and against any claim, suit, demand, loss, damage, expense (including reasonable attorneys’ fees and costs), or liability that may result from, arise out of or relate to (a) acts or omissions by Writer arising out of or in connection with these Terms; (b) intentional or negligent violations by Writer of any applicable laws or governmental regulation; (c) contractual relations between the Writer and a Customer or other third party; or (d) infringement of intellectual property rights including, but not limited to, rights relating to patent and copyright.<\/p>\n<p>This indemnification obligation will survive these Terms and your use of the I3’s Site and\/or platform.<\/p>\n<p>I3 reserves the right to apply penalties for the breach of our Terms. Please adhere to our Terms  in order to avoid any issues; otherwise, it may lead to the permanent closure of your Account.<\/p>\n<p><strong>17. Fines and Restrictions<\/strong><\/p>\n<p>I3 reserves the right to apply fines for the breach of the Terms. The amount of the fine depends on the particular reasons, circumstances, and the amounts refunded back to the Customer:<\/p>\n<p><strong>Requesting to reassign an order after bidding on it due to unfounded reasons<\/strong> – up to 55% of the writer’s total on ordinary orders and 100% on “bid per order” ones<\/p>\n<p><strong>Lateness<\/strong> – up to 60% of the writer’s total if the order was delivered after the deadline, and 100% if it was never uploaded<\/p>\n<p><strong>Ignorance of emails\/phone calls<\/strong> – up to 35% of the writer’s total or limitation of access to new orders for 5-7 days<\/p>\n<p><strong>Ignoring customers’ messages\/not replying to the customer for a long time<\/strong> – up to 35% of the writer’s total or limitation of access to new orders for 5-7 days<\/p>\n<p><strong>Communication issues such as being rude\/demanding to release funds or pay more\/giving false time estimations<\/strong> – up to 35% of the writer’s total depending on the severity of the issue<\/p>\n<p><strong>Low quality\/instructions not followed on a certain order <\/strong> – up to 100% of the writer’s total<\/p>\n<p><strong>Plagiarism<\/strong> (if the order was not cancelled) – up to 80% of the writer’s total<\/p>\n<p><strong>Plagiarism<\/strong> (if the order was cancelled) – 100% of the writer’s total<\/p>\n<p><strong>Agreeing to the wrong deadline and wrong number of pages <\/strong>– 40% of the writer’s total<\/p>\n<p>Getting the “Block-Order Status” means that I3’s QA Department detected the violation of our Terms and\/or the provision of bad service. “Block-Order Status” prevents Writers from taking new orders until the status is removed.<\/p>\n<p>I3 also reserves the right to Block and Unblock the Writer’s Account if any of the violations mentioned below are detected:<\/p>\n<p><strong>Regular reassign requests<\/strong> – block up to 7 days<\/p>\n<p><strong>Sharing personal information<\/strong> – block up to 14 days if the situation happens for the first time and termination of cooperation if the situation repeats<\/p>\n<p><strong>Sharing pricing\/price politics of the platform<\/strong> – block for 7 days if the situation happens for the first time and termination of cooperation if the situation repeats<\/p>\n<p><strong>Lateness on a certain order<\/strong> – block until the file is uploaded<\/p>\n<p><strong>Regular lateness occurrences<\/strong> – block for 7-15 days<\/p>\n<p><strong>Refusing to proceed with revision\/providing a wrong file for revision (including purposefully uploading wrong files)<\/strong> – block until the correct\/properly edited file is uploaded<\/p>\n<p><strong>Being rude to customers<\/strong> – block for 7 days<\/p>\n<p><strong>Posting products produced in the course of performing orders obtained via Writingcreek.com on other platforms<\/strong> – block for 30 days or termination of cooperation depending on the case<\/p>\n<p><strong>Repetitive quality issues<\/strong> – block up to 30 days<\/p>\n<p><strong>Suspicious activity and\/or bad quality<\/strong> – block up to 60 days<\/p>\n<p>Each situation is considered individually, and fines and blocks can be applied cumulatively. The “Block-Order Status” can be applied for a set number of days and is removed automatically by the system.<\/p>\n<p><strong> 18. Termination<\/strong><\/p>\n<p>I3 reserves the right to terminate our cooperation in the following cases:<\/p>\n<p>1) the initial information you provided to register your Account contains false or misleading information, conceals or omits any information we would likely consider important, or was subsequently modified;<\/p>\n<p>2) you do not cooperate for the execution of your orders;<\/p>\n<p>3) we suspect that you are involved in any fraudulent transactions;<\/p>\n<p>4) there is 3+ months inactivity in your Account;<\/p>\n<p>5) the quality of the orders completed by you is below our standards, and there is no progress despite our requests to improve your writing skills and reconsider your attitude to the orders&#8217; performance;<\/p>\n<p>6) posting products produced in the course of performing orders obtained via Writingcreek.com on other platforms;<\/p>\n<p>7) repetitive cases of the Terms violation;<\/p>\n<p>8) attempts to communicate with the Customers outside the Site and\/or platform;<\/p>\n<p>9) sharing personal information;<\/p>\n<p>10) working from several accounts.<\/p>\n<p>Any attempt to undermine or cause harm to I3 or its Customers in any manner is strictly prohibited and will be subject to automatic account termination. This includes spamming, transmitting malware, viruses, Trojan horses, or linking to sites and files that contain or distribute them.<\/p>\n<p>In case of Termination of Account, all the funds from the Writer’s balance will be paid to the Writer on the nearest Payment Date.<\/p>\n<p>I3 reserves the right to apply other penalties for the breach of our Terms. Please adhere to our Terms in order to avoid any issues; otherwise, it may lead to the permanent closure of your Account.<\/p>\n<p><strong>19. Entire Agreement\/Severability\/Waiver<\/strong><\/p>\n<p>These Terms constitute the entire agreement between you and I3 in respect of this Site and\/or platform, and contents thereof, and supersedes all prior agreements, whether written or oral, with respect to the subject matter hereof. In the event that any provision of the Terms shall, in whole or in part, be determined to be invalid, unenforceable, or void for any reason, such determination shall affect only the portion of such provision determined to be invalid, unenforceable, or void, and shall not affect in any way the remainder of such provision or any other provision of the Terms. I3’s failure to act with respect to a breach by Writer or others does not waive its right to act with respect to subsequent or similar breaches. These Terms shall inure to the benefit of and be binding upon each of our respective successors and us, and permitted assigns.<\/p>\n<p><strong>20. Ability to Accept Terms<\/strong><\/p>\n<p>You affirm that you are either older than 18 years of age, or an emancipated minor, or possess legal parental or guardian consent and are fully able and competent to make online transactions; to enter into the terms, conditions, obligations, affirmations, representations, and warranties set forth in these Terms, and abide by and comply with these Terms.<\/p>\n<p><strong>21. Governing Law<\/strong><\/p>\n<p>These Terms shall be governed by the law of Bulgaria. The United Nations Convention on Contracts for the International Sale of Goods shall not apply to these Terms.<\/p>\n<p><strong>22. Dispute Resolution<\/strong><\/p>\n<p>Any action or other judicial proceeding for the enforcement hereof or any of its provisions shall be instituted in the courts of competent jurisdiction of Bulgaria.<\/p>\n<p><strong>23. Contact Us<\/strong><\/p>\n<p>Any questions or concerns about these Terms should be brought to our attention by email to <a href=\"mailto:support@writingcreek.com\"><span style=\"font-weight: 400;\">support@writingcreek.com<\/span><\/a> and provide us with information relating to your concern.<\/p>\n<p><strong>Amendments to These Terms and Conditions<\/strong><\/p>\n<p>We strive to improve the quality of our Site and\/or platform, and thus can change these Terms from time to time. All the amendments will be available on this page.<\/p>\n<p>Last updated on August 12, 2021.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Please Read These Terms Carefully Before Using This Website The contents on this website https:\/\/writingcreek.com (the “Site”) are provided by I3 Technology LTD (hereinafter referred to as “I3”). The Site is an online platform that provides onboarding for Writers to prepare them to taking orders and working with Customers afterward. By using this Site, you agree [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"tpl-blank.php","meta":[],"_links":{"self":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/594"}],"collection":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/comments?post=594"}],"version-history":[{"count":42,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/594\/revisions"}],"predecessor-version":[{"id":865,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/594\/revisions\/865"}],"wp:attachment":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/media?parent=594"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}