{"id":63,"date":"2018-01-02T12:34:58","date_gmt":"2018-01-02T12:34:58","guid":{"rendered":"http:\/\/freelancewriting.boostadev.net\/?page_id=63"},"modified":"2018-10-31T15:56:17","modified_gmt":"2018-10-31T15:56:17","slug":"job-types","status":"publish","type":"page","link":"https:\/\/writingcreek.com\/job-types\/","title":{"rendered":"Job types"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Writingcreek.com<\/span><span style=\"font-weight: 400;\"> is a platform for writers where you are your own boss. Choose the topics you prefer and do your best in covering this field of expertise. We offer a rich variety of themes and types of orders. They are as follows.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you feel that you have a gift of convincing and know all the psychological tricks of persuasive writing, then you are the right person for grant writing. Our clients need advice and support in creating the winning cover letter, which can become a lucky ticket to the future. Many people are not able to formulate their thoughts. They may have brilliant background and knowledge but world worst ability to write cover letters. If you feel like you can help out here, you are welcome to try.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Writers who know every news in the world and watch CNN and BBC daily are wanted to complete works on politics. Here we discuss everything that is going on in the world. This type of job will pass to people who debate on politics every time he or she has this chance with friends, relatives, coworkers, people in a buss, and others. Argumentative thinking is very welcomed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For people who miss research work, proceeding tons of literature, looking for ideas, facts, experiments, and have a deductive type of thinking we have plenty of scientific orders. Here you can free your curiosity and creativity. Among all the types of freelance writing work, this one is the most involving and big. One order can contain from ten to one hundred pages. It is a perfect option for those who want to improve knowledge in a specific field profoundly and earn money.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><a href=\"https:\/\/writingcreek.com\/for-beginners\/\">For beginners<\/a>, we have freelance writing niches, which offer to forget about difficult citation styles and concentrate on short and straightforward writing. We have <a href=\"https:\/\/writingcreek.com\/essay-writing\/\">essays<\/a>, reviews, <a href=\"https:\/\/writingcreek.com\/resume-writing\/\">resumes<\/a>, labs, tasks, and other school assignments that you can finish in one day and earn money. Choose the topic every day. No need to worry about the scope and responsibility. We offer plenty of exciting and short tasks, which will not only help you to earn money but also to broaden your mindset.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whether you are a beginner or a professional writer, a blog post author or a cover overview specialist, specialize in <a href=\"https:\/\/writingcreek.com\/political-writing\/\">political science<\/a> or on philosophy, we have <a href=\"https:\/\/writingcreek.com\/\">online freelance writing jobs<\/a> for you. Register now and try taking orders today.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Writingcreek.com is a platform for writers where you are your own boss. Choose the topics you prefer and do your best in covering this field of expertise. We offer a rich variety of themes and types of orders. They are as follows. If you feel that you have a gift of convincing and know all [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/63"}],"collection":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/comments?post=63"}],"version-history":[{"count":30,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/63\/revisions"}],"predecessor-version":[{"id":671,"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/pages\/63\/revisions\/671"}],"wp:attachment":[{"href":"https:\/\/writingcreek.com\/wp-json\/wp\/v2\/media?parent=63"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}